{
  "places": [
    {
      "location": "Hommlett",
      "location number": "1",
      "name": "prosperous farm cottage and larger barn",
      "visible_text": "This wood and plaster house is well kept, and the barn beyon dis bulging wiht hay, grain and so forth.  Several fat animals are about. Two large farm dogs bark at your approach, and a rosy cheeked goodwife appears at the doorway",
      "hidden_test": "The large goodwife is friendly, greeting all who call, while her four children look on. Inside, a young girl and her old granny do various chores. The lintel over the front door is carved with acorns and oak leaves. If politely asked, any adult in the family will state that the family is of the Old Faith (i. e. druidical).\nThe head of the house and his two fullgrown\nsons are at work in the nearby fields.\nThese three are members of the town militia.\nThe elder has a bill-guisarme and a ring\nmail jack, while his sons have leather armor\nand shield and wield a flail and an axe\n(respectively). Each has a dagger at all\ntimes. They take arms only in self-defense or when called up by the village elder. The two farm dogs will attack intruders if their master or his family are attacked or even visibly threatened."
    },
    {
      "location": "Hommlett",
      "location number": "2",
      "name": "modest farmhouse and bar",
      "visible_text": "Clean but slightly run-down buildings\nindicate that this farm is not very prosperous.\nHowever, the stock appears\nquite healthy and plump. An active lad\nof 12 or so is doing chores. Nothing\nappears of particular interest",
      "hidden_test": "An elderly couple herein are master and\nmistress; the boy is a servant. These folks\nhave nothing to trade. The elders say that\ntheir son Elmo would be interested in talking\nwith strangers—he's at the inn having a\njack of ale. Their other son, Otis (they sadly\nshake their heads), took service with some\ngentlemen and is away seeking his fortune.\nElmo is strong, but not too quick, and is\noverfond of brew.\nThe elderly farmer is a retired fighter still\nsomewhat in practice, equivalent to level 4.\nHe owns a suit of scale mail, a shield, longsword,\nand a light crossbow, all kept in a\nchest in the front room. He is, in fact, captain\nof the local militia, though he will say\nnothing of it."

    }
  ]
}